[
  {
    "workplace": "Webstep",
    "fromTime": "May 2021",
    "toTime": "Present",
    "title": "Consultant",
    "description": "Sopra Steria Group SA is an European information technology consultancy and services company. I Worked as a consultant and was sold out for various projects.",
    "projects": [
      {
        "workplace": "Norgesgruppen Data",
        "fromTime": "May 2021",
        "toTime": "Present",
        "description": "NorgesGruppen Data delivers the overall IT-projects and services in Norgesgruppen. Norgesgruppen is Norway's largest retail company. NorgesGruppen is a Norwegian grocery wholesaling group which also runs various retail outlets.",
        "myRole": "Tony worked mainly with reformatting, this includes, among other things, rewriting of old implementations and technical upgrad of various outdated frameworks. Tony also assisted in the development of other functionalities the team had responsibility for, e.g. item loading. ",
        "tools": "Java, Spring Boot, Spring Batch, Oracle DB, Java EJB"
      }
    ]
  },
  {
    "workplace": "Sopra Steria",
    "fromTime": "Jun. 2020",
    "toTime": "May 2021",
    "title": "Consultant",
    "description": "Sopra Steria Group SA is an European information technology consultancy and services company. I Worked as a consultant and was sold out for various projects.",
    "projects": [
      {
        "workplace": "Vy",
        "fromTime": "Sep. 2020",
        "toTime": "Feb. 2021",
        "description": "Vygruppen is one of the Nordic region's largest transport groups and is responsible for offering trains, buses and freight transport. The operational center in Vy keeps track of trains in Norway, and handles all critical incidents in train traffic.",
        "myRole": "Our team was responsible for managing applications that primarily have Drops (Operational Operations Center) as a \"customer\", but were also responsible for some other applications within the train traffic, such as the internal communication and status reporting. As a team of developers, we had responsibility for the whole stack, from implementation to deployment.",
        "tools": "Groovy on Grails, Java, React, Jenkin, Ansible, MariaDB, ActiveMQ, IBM MQ"
      },
      {
        "workplace": "Mattemaraton",
        "fromTime": "Jun. 2020",
        "toTime": "Sep. 2020",
        "description": "Sopra Seteria's charity project for Kikora, which is a digital teaching aid in mathematics. The project was to develop a new App for their Mattemaraton, one of their motivation project to make school students more engaged in running and math.",
        "tools": ".Net, C#, Xamarin, Android"
      }
    ]
  },
  {
    "workplace": "Accenture",
    "fromTime": "Aug. 2017",
    "toTime": "Jun. 2020",
    "title": "Consultant",
    "description": "Accenture plc is an American-Irish multinational professional services company. I Worked as a consultant and was sold out for various projects. I was also a member of the internal AI group.",
    "projects": [
      {
        "workplace": "Statens Vegvesen",
        "fromTime": "Des. 2019",
        "toTime": "Jun. 2020",
        "description": "Autosys is a motor vehicle and driver's license register for the Norwegian Public Roads Administration (Statens Vegvesen), which have the Norwegian Customs, the police, car dealerships and insurance companies among the users.",
        "myRole": "I worked as a full-stack developer on a team which was responsible for the motor vehicle register.",
        "tools": "Java, Spring boot, React, Redux, Oracle DB, Jenkins, REST, SOAP"
      },
      {
        "workplace": "NAV",
        "fromTime": "Aug. 2017",
        "toTime": "Des. 2019",
        "description": "The pension project was responsible for introducing the pension reform in NAV, where Accenture was the main contract partner. The goal was to develop new solutions for automated case processing and self-services. The pension project was one of Norway's largest change program, with over 400 project-participants and a total budget of 2.9 billion.",
        "myRole": "The tasks was mainly on improving and implementing new features to the backend for case processing and self-services. This includes database-management, implementations of services and also designing solutions. I have been a developer on a development team at Pension that have been through a major change. From being a newly established team with mostly graduates, the team became independent and worked close with the NAV's experts on pension.",
        "tools": "Java, Spring, Oracle DB, DB2, REST, SOAP, Python"
      }
    ]
  },
  {
    "workplace": "Accenture",
    "fromTime": "Jun. 2016",
    "toTime": "Aug. 2016",
    "title": "Intern",
    "description": "Attended the Accenture summer internship 2016, working on a concept project called ConnectedCloset. ConnectedCloset was a prototype development of an smart closet utilizing RFID scanning, for feature such as clothing recommendation based on weather. The closet could connect to a cloud service MQTT, and been used as a demo for recruiting.",
    "tools": "Python, Angluar, Raspberry Pi, RabbitMq, Neo4j, MongoDB"
  },
  {
    "workplace": "Finatext Ltd",
    "fromTime": "Oct. 2015",
    "toTime": "Dec. 2015",
    "title": "Intern",
    "description": "While exchanging in Japan, I worked as a part-time intern for Finatext, a company that provides a range of mobile financial services. I worked on developing a responsive interface for one of their mobile financial service (あすかぶ) websites, and also an interface for their corporate website.",
    "tools": "Javascript, CSS, HTML"
  },
  {
    "workplace": "NTNU",
    "fromTime": "Aug. 2014",
    "toTime": "Nov. 2014",
    "title": "Student Assistant - TDT4110/TDT4105",
    "description": "Helping students with the course TDT4110/4105 (IT Basics Course)."
  },
  {
    "workplace": "NTNU",
    "fromTime": "Aug. 2013",
    "toTime": "Nov. 2013",
    "title": "Student Assistant - TDT4125",
    "description": "Helping students with the course TDT4125 (Algorithm and Computer structures)."
  }
]
